# Import Data from CSV

In [43]:
import pandas as pd
df = pd.read_csv('http://bit.ly/drinksbycountry')
df.tail(10)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
183,Tanzania,36,6,1,5.7,Africa
184,USA,249,158,84,8.7,North America
185,Uruguay,115,35,220,6.6,South America
186,Uzbekistan,25,101,8,2.4,Asia
187,Vanuatu,21,18,11,0.9,Oceania
188,Venezuela,333,100,3,7.7,South America
189,Vietnam,111,2,1,2.0,Asia
190,Yemen,6,0,0,0.1,Asia
191,Zambia,32,19,4,2.5,Africa
192,Zimbabwe,64,18,4,4.7,Africa

# Describe Dataset

In [44]:
dfstats=df.describe()
dfstats

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
count,193.000000,193.000000,193.000000,193.000000
mean,106.160622,80.994819,49.450777,4.717098
std,101.143103,88.284312,79.697598,3.773298
min,0.000000,0.000000,0.000000,0.000000
25%,20.000000,4.000000,1.000000,1.300000
50%,76.000000,56.000000,8.000000,4.200000
75%,188.000000,128.000000,59.000000,7.200000
max,376.000000,438.000000,370.000000,14.400000

# Column Information

In [45]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 9.2+ KB

# Determine If DataFrame or Series

In [46]:
type(df)

pandas.core.frame.DataFrame

# Determine Data Type of a column

In [47]:
df.beer_servings.dtype

dtype('int64')

# Determine # of Rows and Columns in a DataFrame

In [48]:
df.shape

(193, 6)

# Determine Data Type for All Columns in a Dataframe

In [49]:
df.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 9.2+ KB

# Delete a Column

In [10]:
df =df.drop(['total_litres_of_pure_alcohol'], axis=1).head()
df

       country  beer_servings  spirit_servings  wine_servings continent
0  Afghanistan              0                0              0      Asia
1      Albania             89              132             54    Europe
2      Algeria             25                0             14    Africa
3      Andorra            245              138            312    Europe
4       Angola            217               57             45    Africa

# Check is there is Null values in head

In [11]:
df.isnull().head()

   country  beer_servings  spirit_servings  wine_servings  continent
0    False          False            False          False      False
1    False          False            False          False      False
2    False          False            False          False      False
3    False          False            False          False      False
4    False          False            False          False      False

# Check Sum of Null Values By Column

In [12]:
df.isnull().sum()

country            0
beer_servings      0
spirit_servings    0
wine_servings      0
continent          0
dtype: int64

# Groupby Continent based on Sum and Drop "total litres"

In [61]:
groupby=df.groupby(['continent']).sum()
groupby

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
Africa,3258,866,862,159.4
Asia,1630,2677,399,95.5
Europe,8720,5965,6400,387.8
North America,3345,3812,564,137.9
Oceania,1435,935,570,54.1
South America,2101,1377,749,75.7

In [62]:
mean4=df.groupby(['continent']).mean()
mean4

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
Africa,61.471698,16.339623,16.264151,3.007547
Asia,37.045455,60.840909,9.068182,2.170455
Europe,193.777778,132.555556,142.222222,8.617778
North America,145.434783,165.739130,24.521739,5.995652
Oceania,89.687500,58.437500,35.625000,3.381250
South America,175.083333,114.750000,62.416667,6.308333

In [63]:
(df['beer_servings']>50.00).head()

0    False
1     True
2    False
3     True
4     True
Name: beer_servings, dtype: bool

In [64]:
gt50 = df.loc[df['beer_servings']>50]
gt50

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
1,Albania,89,132,54,4.9,Europe
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa
5,Antigua & Barbuda,102,128,45,4.9,North America
6,Argentina,193,25,221,8.3,South America
...,...,...,...,...,...,...
184,USA,249,158,84,8.7,North America
185,Uruguay,115,35,220,6.6,South America
188,Venezuela,333,100,3,7.7,South America
189,Vietnam,111,2,1,2.0,Asia
192,Zimbabwe,64,18,4,4.7,Africa

In [65]:
mean.to_csv ('meandrink2.csv', index = True, header=True)

NameError: name 'mean' is not defined

In [60]:
mean.drop(['index_col'], axis=1)

NameError: name 'mean' is not defined

In [19]:
mean4=df.groupby(['continent']).mean()

In [20]:
mean4

           beer_servings  spirit_servings  wine_servings
continent
Africa             121.0             28.5           29.5
Asia                 0.0              0.0            0.0
Europe             167.0            135.0          183.0

In [21]:
mean5 = mean4.reset_index()

In [22]:
mean5

  continent  beer_servings  spirit_servings  wine_servings
0    Africa          121.0             28.5           29.5
1      Asia            0.0              0.0            0.0
2    Europe          167.0            135.0          183.0

In [23]:
df.describe()

       beer_servings  spirit_servings  wine_servings
count       5.000000         5.000000       5.000000
mean      115.200000        65.400000      85.000000
std       111.023421        67.696381     128.798292
min         0.000000         0.000000       0.000000
25%        25.000000         0.000000      14.000000
50%        89.000000        57.000000      45.000000
75%       217.000000       132.000000      54.000000
max       245.000000       138.000000     312.000000

# Create Boolean Conditions for Beer, Spirit, Wine Exceeding Average

In [66]:
df["BeerLover"]=(df['beer_servings'] > 100)
df['SpiritLover']=(df['spirit_servings']> 80)
df['WineLover']=(df['wine_servings']> 50)
df.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent,BeerLover,SpiritLover,WineLover
0,Afghanistan,0,0,0,0.0,Asia,False,False,False
1,Albania,89,132,54,4.9,Europe,False,True,True
2,Algeria,25,0,14,0.7,Africa,False,False,False
3,Andorra,245,138,312,12.4,Europe,True,True,True
4,Angola,217,57,45,5.9,Africa,True,False,False

In [67]:
df.beer_servings.dtype

dtype('int64')

# Count total number of True/False

In [68]:
df.SpiritLover.value_counts()

False    116
True      77
Name: SpiritLover, dtype: int64

# Isolate Beer Condition to Create Index

In [27]:
beertrue=df['BeerLover']
beertrue

0    False
1    False
2    False
3     True
4     True
Name: BeerLover, dtype: bool

# Create DataFrame to Only Include True Condition for Beer

In [28]:
beeronly=df[beertrue]
beeronly

,country,beer_servings,spirit_servings,wine_servings,continent,BeerLover,SpiritLover,WineLover
3,Andorra,245,138,312,Europe,True,True,True
4,Angola,217,57,45,Africa,True,False,False

# Groupby Beer Condition by Continent

In [29]:
beergb = beeronly.groupby(['continent']).mean()
beergb

,beer_servings,spirit_servings,wine_servings,BeerLover,SpiritLover,WineLover
continent,,,,,,
Africa,217,57,45,True,False,False
Europe,245,138,312,True,True,True

# Plot Only Binary Conditions

# Isolate a DataFrame Column to a Series

In [30]:
type(df.continent)

pandas.core.series.Series

In [31]:
type(df["beer_servings"])

pandas.core.series.Series

# Create a new series using concatenate

In [32]:
df['nationcont'] = df.country+df.continent

In [33]:
type(df["nationcont"])

pandas.core.series.Series

In [34]:
type(df.nationcont)

pandas.core.series.Series

In [35]:
df.head()

,country,beer_servings,spirit_servings,wine_servings,continent,BeerLover,SpiritLover,WineLover,nationcont
0,Afghanistan,0,0,0,Asia,False,False,False,AfghanistanAsia
1,Albania,89,132,54,Europe,False,True,True,AlbaniaEurope
2,Algeria,25,0,14,Africa,False,False,False,AlgeriaAfrica
3,Andorra,245,138,312,Europe,True,True,True,AndorraEurope
4,Angola,217,57,45,Africa,True,False,False,AngolaAfrica

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   country          5 non-null      object
 1   beer_servings    5 non-null      int64
 2   spirit_servings  5 non-null      int64
 3   wine_servings    5 non-null      int64
 4   continent        5 non-null      object
 5   BeerLover        5 non-null      bool
 6   SpiritLover      5 non-null      bool
 7   WineLover        5 non-null      bool
 8   nationcont       5 non-null      object
dtypes: bool(3), int64(3), object(3)
memory usage: 383.0+ bytes

# Demonstrate the difference Between Inplace =True/False

In [37]:
df.drop('nationcont', axis=1) #inplace=False

,country,beer_servings,spirit_servings,wine_servings,continent,BeerLover,SpiritLover,WineLover
0,Afghanistan,0,0,0,Asia,False,False,False
1,Albania,89,132,54,Europe,False,True,True
2,Algeria,25,0,14,Africa,False,False,False
3,Andorra,245,138,312,Europe,True,True,True
4,Angola,217,57,45,Africa,True,False,False

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   country          5 non-null      object
 1   beer_servings    5 non-null      int64
 2   spirit_servings  5 non-null      int64
 3   wine_servings    5 non-null      int64
 4   continent        5 non-null      object
 5   BeerLover        5 non-null      bool
 6   SpiritLover      5 non-null      bool
 7   WineLover        5 non-null      bool
 8   nationcont       5 non-null      object
dtypes: bool(3), int64(3), object(3)
memory usage: 383.0+ bytes

In [39]:
df.drop('nationcont', axis=1, inplace=True)

# 'Inplace=True' will permanently remove column

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   country          5 non-null      object
 1   beer_servings    5 non-null      int64
 2   spirit_servings  5 non-null      int64
 3   wine_servings    5 non-null      int64
 4   continent        5 non-null      object
 5   BeerLover        5 non-null      bool
 6   SpiritLover      5 non-null      bool
 7   WineLover        5 non-null      bool
dtypes: bool(3), int64(3), object(2)
memory usage: 343.0+ bytes

# Drop the first five rows of a dataframe

In [ ]:
df.drop([0,1,2,3,4], axis=0).head()

In [ ]:
df.shape

In [ ]:
df.drop([0,1,2,3,4], axis=0, inplace=True)

In [ ]:
df.shape

# Sort a dataframe column

In [ ]:
df.sort_values('continent', ascending=True).head()

In [ ]:
df.sort_values('beer_servings', ascending = False).head()

In [ ]:
df.sort_values(['wine_servings'], ascending = False)

In [ ]:
df.loc[df['country']=='Lebanon']

In [ ]:
df.loc[[94]]

In [ ]:
df.iloc[[89]]

In [ ]:
df[40:90]

In [ ]:
df['sumal'] = df.beer_servings + df.spirit_servings + df.wine_servings

In [ ]:
df.head()

In [ ]:
df.continent.value_counts()